1. Товары дороже средней цены
SELECT название, цена, категория
FROM Товар
WHERE цена > (SELECT AVG(цена) FROM Товар);

2. Топ‑5 самых популярных товаров по количеству проданных штук
SELECT Товар.название, SUM(Заказ.количество) AS всего_продано
FROM Заказ
JOIN Товар ON Заказ.товар_id = Товар.id
GROUP BY Товар.id, Товар.название
ORDER BY всего_продано DESC
LIMIT 5;
3. Товары, которых нет в наличии
SELECT название, категория, количество
FROM Товар
WHERE количество = 0;
4. Заказы за последнюю неделю
SELECT id, дата, клиент, товар_id, количество
FROM Заказ
WHERE дата >= DATE('now', '-7 days');
5. Средняя цена в каждой категории
SELECT категория, AVG(цена) AS средняя_цена, COUNT(*) AS товаров_в_категории
FROM Товар
GROUP BY категория;
6. Клиенты, сделавшие больше одного заказа
SELECT клиент, COUNT(*) AS количество_заказов
FROM Заказ
GROUP BY клиент
HAVING COUNT(*) > 1;
7. Товары с ценой от 1000 до 1300 рублей
SELECT название, цена, категория
FROM Товар
WHERE цена BETWEEN 1000 AND 5000;

8. Все заказы конкретного товаровов
SELECT Заказ.дата, Заказ.клиент, Заказ.количество
FROM Заказ
JOIN Товар ON Заказ.товар_id = Товар.id
WHERE Товар.название = 'Чай зелёный';
9. Количество уникальных клиентов и общее число заказов
SELECT COUNT(DISTINCT клиент) AS уникальных_клиентов, COUNT(*) AS всего_заказов
FROM Заказ;
10. Товары, в названии которых нет буквы «а»
SELECT название, цена
FROM Товар
WHERE название NOT LIKE '%а%';
